alibaba/AliOS-Things/platform/mcu/cy8c4147/PSoC4/cy_em_eeprom.c
/*******************************************************************************
* Function Name: GetAddresses
****************************************************************************//**
*
* Calculates the start and end address of the row's EEPROM data to be updated.
* The start and end are not absolute addresses but a relative addresses in a
* flash row.
*
* \param startAddr
* The pointer the address where the EEPROM data start address will be returned.
*
* \param endAddr
* The pointer the address where the EEPROM data end address will be returned.
*
* \param offset
* The pointer the address where the calculated offset of the EEPROM header data
* will be returned.
*
* \param rowNum
* The row number that is about to be written.
*
* \param addr
* The address of the EEPROM header data in the currently analyzed row that may
* concern to the row about to be written.
*
* \param len
* The length of the EEPROM header data in the currently analyzed row that may
* concern to the row about to be written.
*
* \return
* Zero indicates that the currently analyzed row has the data to be written to
* the active EEPROM row data locations. Non zero value indicates that there is
* no data to be written
*
*******************************************************************************/
static uint32 GetAddresses(uint32 *startAddr, 
                        uint32 *endAddr, 
                        uint32 *offset,
                        uint32 rowNum,
                        uint32 addr,
                        uint32 len)
{
    uint32 skip = 0u;

    *offset =0u;

    if(0u != CY_EM_EEPROM_IS_ADDR_IN_ROW_RANGE(addr, rowNum))
    {
        *startAddr = CY_EM_EEPROM_EEPROM_DATA_LEN + (addr % CY_EM_EEPROM_EEPROM_DATA_LEN);

        if(0u != CY_EM_EEPROM_IS_ADDR_IN_ROW_RANGE(addr + len, rowNum))
        {
            *endAddr = *startAddr + len;
        }
        else
        {
            *endAddr = CY_EM_EEPROM_FLASH_SIZEOF_ROW;
        }
    }
    else
    {

        if(0u != CY_EM_EEPROM_IS_ADDR_IN_ROW_RANGE(addr + len, rowNum))
        {
            *startAddr = CY_EM_EEPROM_EEPROM_DATA_LEN;
            *endAddr = (*startAddr + len) - (*startAddr - (addr % CY_EM_EEPROM_EEPROM_DATA_LEN));
            *offset = len - (*endAddr - *startAddr);
        }
        else
        {
            skip++;
        }
    }

    return (skip);
}


/*******************************************************************************
* Function Name: FillChecksum
****************************************************************************//**
*
* Performs calculation of the checksum on each row in the Em_EEPROM and fills
* the Em_EEPROM headers checksum field with the calculated checksums.
*
* \param context
* The pointer to the EEPROM context structure.
*
* \return
* error / status code. See \ref cy_en_em_eeprom_status_t.
*
* \theory 
* In case if redundant copy option is used the Em_EEPROM would return bad 
* checksum while trying to read the EEPROM rows which were not yet written by 
* the user. E.g. any read after device reprogramming without previous Write() 
* operation to the EEPROM would fail. This would happen because the Em_EEPROM 
* headers checksum field values (which is zero at the moment) would not be 
* equal to the actual data checksum. This function allows to avoid read failure
* after device reprogramming. 
*
* \note
* This function uses a buffer of the flash row size to perform read
* operation. For the size of the row refer to the specific PSoC device
* datasheet.
*
*******************************************************************************/
static cy_en_em_eeprom_status_t FillChecksum(cy_stc_eeprom_context_t * context)
{
    uint32 i;
    uint32 rdAddr;
    uint32 writeRamBuffer[CY_EM_EEPROM_FLASH_SIZEOF_ROW / CY_EM_EEPROM_U32_DIV];
    uint32 wrAddr = context->lastWrRowAddr;
    uint32 tmpRowAddr;
    /* Get the sequence number (number of writes) */
    uint32 seqNum = CY_EM_EEPROM_GET_SEQ_NUM(wrAddr);
    cy_en_em_eeprom_status_t ret = CY_EM_EEPROM_BAD_PARAM;

    for(i = 0u; i < (context->numberOfRows * context->wearLevelingFactor); i++)
    {
        /* Copy the EEPROM row from Flash to RAM */
        (void)memcpy((void *)&writeRamBuffer[0u], (void *)(wrAddr), CY_EM_EEPROM_FLASH_SIZEOF_ROW);

        /* Increment the sequence number */
        seqNum++;
        writeRamBuffer[CY_EM_EEPROM_HEADER_SEQ_NUM_OFFSET_U32] = seqNum;

        /* Calculate and fill the checksum to the Em_EEPROM header */
        writeRamBuffer[CY_EM_EEPROM_HEADER_CHECKSUM_OFFSET_U32] = (uint32)
                    CalcChecksum((uint8 *) &writeRamBuffer[CY_EM_EEPROM_EEPROM_DATA_OFFSET_U32],
                                              CY_EM_EEPROM_EEPROM_DATA_LEN);

        /* Write the data to the specified flash row */
        ret = WriteRow(wrAddr, writeRamBuffer, context);

        /* Update the row address to point to the relevant row in the redundant 
        * EEPROM's copy.
        */
        tmpRowAddr = (wrAddr - context->userFlashStartAddr) + context->wlEndAddr;

        /* Write the data to the specified flash row */
        ret = WriteRow(tmpRowAddr, writeRamBuffer, context);

        /* Get the address of the next row to be written. 
        * "rdAddr" is not used in this function but provided to prevent NULL 
        * pointer exception in GetNextRowToWrite().
        */
        GetNextRowToWrite(seqNum, &wrAddr, &rdAddr, context);
    }
    
    return(ret);
}

/** \endcond */

#if defined(__cplusplus)
}
#endif

/* [] END OF FILE */
